packerlschupfer/esp32-boiler-controller/src/main.cpp
// src/main.cpp - Streamlined version with SystemInitializer
#include <Arduino.h>
#include "config/ProjectConfig.h"
#include "config/SystemConstants.h"
#include "init/SystemInitializer.h"
#include "utils/ErrorHandler.h"
// #include "utils/EarlyLogCapture.h"  // Not needed - monitor connects early
#include "shared/GlobalComponents.h"
#include <TaskManager.h>
#include <Watchdog.h>
#include "LoggingMacros.h"
#ifndef LOG_NO_CUSTOM_LOGGER
#include <Logger.h>
#include <LogInterfaceImpl.cpp>  // Include implementation once
#endif
#include "core/SharedResourceManager.h"
#include <MB8ART.h>
#include <RYN4.h>
#include "MQTTManager.h"
#include <esp32ModbusRTU.h>
#include <unordered_map>
#include "modules/control/HeatingControlModule.h"
#include "modules/control/PIDControlModule.h"
#include "shared/SharedSensorReadings.h"
#include "shared/SharedRelayReadings.h"
// BLE includes removed - using MB8ART channel 7 for inside temperature
#include "core/SystemResourceProvider.h"
#include "modules/tasks/TimerSchedulerTask.h"
#include "modules/tasks/NTPTask.h"
#include <esp_log.h>

// BurnerSystemController is created in SystemInitializer and passed to WheaterControlTask via parameter

// Task function declarations are now in header files
#include <nvs_flash.h>
#include <cstring>  // for strcmp
#include <RuntimeStorage.h>
#include <esp_task_wdt.h>  // For disabling global watchdog

// Type alias to avoid IntelliSense confusion with namespace/class naming
using RuntimeStoragePtr = class rtstorage::RuntimeStorage*;

// Configuration constants
constexpr uint32_t SERIAL_TIMEOUT_MS = 2000;

// Override weak function to reduce loopTask stack size
// This function has C++ linkage in Arduino.h
size_t getArduinoLoopTaskStackSize() {
    return STACK_SIZE_LOOP_TASK;  // Use configured stack size from ProjectConfig.h
}

// Note: The following functions may or may not exist in the framework
// We declare them as weak so they don't cause linker errors if unused
__attribute__((weak)) size_t getArduinoEventTaskStackSize() {
    return 3072;  // Attempt to reduce arduino_events stack
}

__attribute__((weak)) size_t getTimerTaskStackSize() {
    return 3072;  // Attempt to reduce timer service stack
}

// Global system initializer instance
SystemInitializer* gSystemInitializer = nullptr;

// Logger now uses singleton pattern - Logger::getInstance()
// The singleton automatically creates itself with ConsoleBackend
// auto consoleBackend = std::make_shared<ConsoleBackend>();
// Logger logger(consoleBackend);

// Global task manager with Watchdog singleton injection
TaskManager taskManager(&Watchdog::getInstance());

// Modbus master instance
esp32ModbusRTU modbusMaster(&Serial1);

// Global device map is defined in ModbusDevice.cpp
// Access via SRP::getDeviceMap() and SRP::getDeviceMapMutex()

// Legacy global device pointers (for backward compatibility)
// These are updated by the accessor functions
MB8ART* MB8ART1 = nullptr;
RYN4* RYN41 = nullptr;

// Runtime storage (FRAM) for persistent data
RuntimeStoragePtr gRuntimeStorage = nullptr;

// Control modules are accessed via SRP (SystemResourceProvider)
// ServiceContainer has been removed - use SRP::getXXX() methods

// Task handles
TaskHandle_t burnerTaskHandle = nullptr;

// Shared data structures are defined in their respective .cpp files

// Event groups (temporarily defined here until fully migrated to SharedResourceManager)
EventGroupHandle_t xGeneralSystemEventGroup = nullptr;

// RYN4 relay status bits are defined in RYN4.cpp
// Access via SRP::getRelayAllUpdateBits() and SRP::getRelayAllErrorBits()

// Other global variables from SharedResources.h
int pidFactorSpaceHeating = 1;
int pidFactorWaterHeating = 1;

// Forward declarations for runtime functions
void handleRuntimeTasks();
void updateSystemHealth();
void configureLibraryLogging();
void setQuietMode();
void setVerboseMode();
void enableLibraryDebug(const char* libName);
void restoreNormalLogging();

// Helper function to ensure clean logging during critical sections
void flushLogsWithDelay(uint32_t delayMs = 50) {
    #ifndef LOG_NO_CUSTOM_LOGGER
    // Removed flush() - can cause blocking with full serial buffer
    vTaskDelay(pdMS_TO_TICKS(delayMs));
    #endif
}

void setup() {
    // Phase 1: Critical early initialization
    Serial.setTxBufferSize(8192);  // Maximum buffer size to prevent any log loss
    Serial.begin(SERIAL_BAUD_RATE);
    
    // Boot markers to verify monitor connection
    Serial.println("\n\n========== ESP32 BOOT START ==========");
    Serial.println("If you see this, monitor connected early");
    Serial.println("======================================\n");
    Serial.flush();
    
    // Small delay to ensure serial is stable
    delay(100);
    
    // Note: Removed Serial.println to avoid duplicate logs
    
    // Initialize NVS flash before any usage
    // IMPORTANT: Arduino framework tries to init NVS very early in initArduino()
    // We need to ensure it's properly initialized for our use
    
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        // NVS partition needs erasing
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    
    if (ret != ESP_OK) {
        // NVS init failed but continuing
    } else {
        // NVS initialized successfully
    }

    // Note: ESP32 global task watchdog cannot be fully disabled (Arduino framework requirement)
    // Tasks must either:
    //   1. Call esp_task_wdt_reset() periodically, OR
    //   2. Unsubscribe via esp_task_wdt_delete(NULL)
    // We feed both watchdogs (ESP32 global + TaskManager) in critical tasks

    // Initialize Logger early to ensure it's ready for all logging
    #ifndef LOG_NO_CUSTOM_LOGGER
    Logger& logger = Logger::getInstance();
    
    // Logger now uses NonBlockingConsoleBackend by default
    
    // Initialize the logger with larger buffer to prevent overflow during startup
    logger.init(1024);  // Further increased buffer size to prevent message loss during heavy init
    
