packerlschupfer/esp32-boiler-controller/src/main.cpp
    // Set the log level based on build mode
    #ifdef LOG_MODE_RELEASE
        logger.setLogLevel(ESP_LOG_WARN);  // Only warnings and errors in release
    #else
        logger.setLogLevel(ESP_LOG_INFO);     // Set default log level
    #endif
    
    // Disable rate limiting during startup for complete logs
    logger.setMaxLogsPerSecond(0);  // 0 = unlimited
    
    // Enable ESP-IDF log redirection to prevent interleaving
    logger.enableESPLogRedirection();
    
    // Configure tag-specific logging levels
    configureLibraryLogging();
    
    // Test logger is working
    LOG_INFO("BOOT", "Logger initialized and ready");
    
    // Flush to ensure early logs are visible immediately
    logger.flush();
    #else
    // When using ESP-IDF logging, set default log level
    esp_log_level_set("*", ESP_LOG_INFO);
    LOG_INFO("BOOT", "Using ESP-IDF logging (no custom logger)");
    #endif
    
    // Suppress verbose HAL and other logs early
    #if defined(LOG_MODE_DEBUG_SELECTIVE)
        // Force selective logging mode - suppress verbose output
        esp_log_level_set("*", ESP_LOG_INFO);
        esp_log_level_set("efuse", ESP_LOG_NONE);
        esp_log_level_set("cpu_start", ESP_LOG_NONE);
        esp_log_level_set("heap_init", ESP_LOG_NONE);
        esp_log_level_set("intr_alloc", ESP_LOG_NONE);
        esp_log_level_set("spi_flash", ESP_LOG_WARN);
        esp_log_level_set("wifi", ESP_LOG_NONE);
        esp_log_level_set("wifi_init", ESP_LOG_NONE);
        esp_log_level_set("phy_init", ESP_LOG_NONE);
        esp_log_level_set("esp_core_dump_flash", ESP_LOG_NONE);  // Suppress core dump partition errors
        esp_log_level_set("esp_core_dump_elf", ESP_LOG_NONE);
    #endif
    
    // Set up LED for status indication
    pinMode(LED_BUILTIN, OUTPUT);
    digitalWrite(LED_BUILTIN, LOW);
    
    // Phase 2: Initialize critical resources
    // Device map mutex is now managed by ModbusRegistry singleton
    // No need to create it manually - ModbusRegistry::getInstance().getMutex() provides it
    
    // Create general system event group
    xGeneralSystemEventGroup = xEventGroupCreate();
    if (!xGeneralSystemEventGroup) {
        Serial.println("FATAL: Failed to create general system event group!");
        while (true) {
            digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
            delay(SystemConstants::Timing::FAILSAFE_LED_BLINK_MS);
        }
    }
    
    // Early initialization of critical singletons to prevent deadlock
    // Force singleton initialization in main thread before any tasks start
    LOG_INFO(LOG_TAG_MAIN, "Pre-initializing critical singletons...");
    SharedResourceManager::getInstance();  // Initialize SharedResourceManager singleton
    // ServiceContainer removed - services accessed via SRP and gSystemInitializer
    
    // Phase 3: Create and run SystemInitializer
    // Use logger for banner output with proper line endings
    LOG_INFO(LOG_TAG_MAIN, "");
    LOG_INFO(LOG_TAG_MAIN, "==== ESPlan Boiler Controller ====");
    LOG_INFO(LOG_TAG_MAIN, "%s v%s", PROJECT_NAME, FIRMWARE_VERSION);
    LOG_INFO(LOG_TAG_MAIN, "==================================");
    LOG_INFO(LOG_TAG_MAIN, "");
    
    LOG_INFO(LOG_TAG_MAIN, "About to create SystemInitializer...");
    
    gSystemInitializer = new SystemInitializer();
    if (!gSystemInitializer) {
        Serial.println("FATAL: Failed to allocate SystemInitializer!");
        // Enter permanent failsafe
        while (true) {
            digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
            delay(SystemConstants::Timing::FAILSAFE_LED_BLINK_MS);
        }
    }
    
    LOG_INFO(LOG_TAG_MAIN, "SystemInitializer created, about to call initializeSystem()...");
    
    // Run system initialization
    auto result = gSystemInitializer->initializeSystem();
    
    if (result.isError()) {
        // Log critical error
        Serial.printf("FATAL: System initialization failed at stage %d: %s\n", 
                     static_cast<int>(gSystemInitializer->getCurrentStage()),
                     ErrorHandler::errorToString(result.error()));
        
        // Attempt cleanup
        gSystemInitializer->cleanup();
        
        // Enter failsafe mode
        ErrorHandler::enterFailsafeMode(result.error());
        
        // Infinite loop with LED indication
        while (true) {
            digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
            delay(SystemConstants::Timing::FAILSAFE_LED_BLINK_MS);
        }
    }
    
    // Phase 3: System successfully initialized
    digitalWrite(LED_BUILTIN, HIGH); // LED on = system running
    
    // Re-apply task_wdt suppression after system init (in case it was overridden)
    // These errors come from NimBLE and are harmless
    esp_log_level_set("task_wdt", ESP_LOG_NONE);
    
    // Update legacy global pointers
    getMB8ART();  // Updates MB8ART1
    getRYN4();    // Updates RYN41
    
    // Control modules are initialized in SystemInitializer
    // Access them using SRP::getXXX() methods (ServiceContainer removed)

    // BurnerControlTask is already initialized in TaskInitializer::initializeTasks()
    // No need to call initializeBurnerControlTask() again here

    // BurnerSystemController is now created in SystemInitializer::initializeControlModules()
    // and passed to WheaterControlTask via parameter (Pattern B: parameter passing)

    // Initialize NTPTask for network time synchronization
    LOG_INFO(LOG_TAG_MAIN, "Initializing NTPTask...");

    // Enable watchdog with sufficient timeout for NTP operations (5s sync + margin)
    TaskManager::WatchdogConfig ntpWdtConfig = TaskManager::WatchdogConfig::enabled(
        false,  // not critical (won't reset system)
        15000   // 15 second timeout (5s NTP sync + 5s event wait + margin)
    );
    
    if (SRP::getTaskManager().startTaskPinned(
        NTPTask,
        "NTPTask",
        4096,  // Stack size increased to prevent overflow
        nullptr,
        2,     // Priority - same as monitoring task
        0,     // Core 0
        ntpWdtConfig)) {
        LOG_INFO(LOG_TAG_MAIN, "NTPTask created successfully");
    } else {
        LOG_WARN(LOG_TAG_MAIN, "Failed to create NTPTask (non-critical)");
    }
    
    // Initialize TimerSchedulerTask (generic scheduler for water and space heating)
    LOG_INFO(LOG_TAG_MAIN, "Initializing TimerSchedulerTask...");

    TaskManager::WatchdogConfig timerWdtConfig = TaskManager::WatchdogConfig::disabled();
    if (SRP::getTaskManager().startTaskPinned(
        TimerSchedulerTask,
        "TimerSched",
        STACK_SIZE_TIMER_SCHEDULER_TASK,
        nullptr,
        2,     // Priority - same as monitoring task
        0,     // Core 0
        timerWdtConfig)) {
        LOG_INFO(LOG_TAG_MAIN, "TimerSchedulerTask created successfully");
    } else {
        LOG_WARN(LOG_TAG_MAIN, "Failed to create TimerSchedulerTask (non-critical)");
    }
    
