packerlschupfer/esp32-boiler-controller/src/main.cpp
    LOG_INFO(LOG_TAG_MAIN, "==================================");
    LOG_INFO(LOG_TAG_MAIN, "System initialization complete!");
    LOG_INFO(LOG_TAG_MAIN, "Free heap: %d bytes", ESP.getFreeHeap());
    LOG_INFO(LOG_TAG_MAIN, "==================================");
    
    // Wait for logs to output before re-enabling rate limiting
    #ifndef LOG_NO_CUSTOM_LOGGER
    // Removed flush() - can cause blocking with full serial buffer
    vTaskDelay(pdMS_TO_TICKS(100));  // Give time for serial output
    
    // Re-enable rate limiting with higher limit for normal operation
    Logger::getInstance().setMaxLogsPerSecond(200);  // Increased from 100 to prevent drops
    LOG_INFO(LOG_TAG_MAIN, "Rate limiting enabled: 200 logs/second");
    
    // Restore normal logging levels after startup
    restoreNormalLogging();
    #endif
}

void loop() {
    // Main loop delegates to runtime handlers
    handleRuntimeTasks();
    updateSystemHealth();
    
    // Small delay to prevent watchdog issues
    delay(1);
}

/**
 * @brief Handle runtime tasks that need periodic execution
 */
void handleRuntimeTasks() {
    // Check for any system-wide events
    if (gSystemInitializer && gSystemInitializer->isFullyInitialized()) {
        // System is running normally
        static uint32_t lastMemoryReport = 0;
        uint32_t now = millis();
        
        // Memory monitoring every 5 minutes (or immediately if low)
        if (now - lastMemoryReport > 300000) {  // 5 minutes
            lastMemoryReport = now;
            size_t freeHeap = ESP.getFreeHeap();
            size_t minFreeHeap = ESP.getMinFreeHeap();
            
            if (freeHeap < 15000) {
                LOG_WARN(LOG_TAG_MAIN, "LOW MEMORY WARNING: Free: %d, Min: %d bytes", 
                         freeHeap, minFreeHeap);
            } else {
                LOG_DEBUG(LOG_TAG_MAIN, "Memory status: Free: %d, Min: %d bytes", 
                          freeHeap, minFreeHeap);
            }
        }
        
        // Check for critically low memory more frequently
        size_t currentFreeHeap = ESP.getFreeHeap();
        if (currentFreeHeap < 15000) {
            static uint32_t lastLowMemoryWarning = 0;
            if (now - lastLowMemoryWarning > 10000) {  // Warn every 10s when memory is low
                lastLowMemoryWarning = now;
                LOG_WARN(LOG_TAG_MAIN, "LOW MEMORY WARNING: Free: %d bytes", currentFreeHeap);
            }
        }
    }
}

/**
 * @brief Update system health indicators
 */
void updateSystemHealth() {
    static uint32_t lastLedToggle = 0;
    static bool ledState = true;
    uint32_t now = millis();
    
    // Heartbeat LED pattern when system is healthy
    if (gSystemInitializer && gSystemInitializer->isFullyInitialized()) {
        // Slow blink = healthy (1Hz)
        if (now - lastLedToggle > 1000) {
            lastLedToggle = now;
            ledState = !ledState;
            digitalWrite(LED_BUILTIN, ledState);
        }
    }
    // Fast blink handled in error conditions above
}

// Accessor functions for global components
MB8ART* getMB8ART() {
    MB8ART* device = gSystemInitializer ? gSystemInitializer->getMB8ART() : nullptr;
    // Update legacy global pointer
    MB8ART1 = device;
    return device;
}

RYN4* getRYN4() {
    RYN4* device = gSystemInitializer ? gSystemInitializer->getRYN4() : nullptr;
    // Update legacy global pointer
    RYN41 = device;
    return device;
}

MQTTManager* getMQTTManager() {
    return gSystemInitializer ? gSystemInitializer->getMQTTManager() : nullptr;
}

PIDControlModule* getPIDControl() {
    return gSystemInitializer ? gSystemInitializer->getPIDControl() : nullptr;
}

// Logging configuration functions
void configureLibraryLogging() {
    #ifndef LOG_NO_CUSTOM_LOGGER
    Logger& logger = Logger::getInstance();
    
    // ========== Critical System Components ==========
    // Reduce verbosity during startup to prevent buffer overflow
    logger.setTagLevel("BurnerControl", ESP_LOG_WARN);  // Reduced from INFO
    logger.setTagLevel("HeatingControl", ESP_LOG_WARN);  // Reduced from INFO
    logger.setTagLevel("WheaterControl", ESP_LOG_WARN);  // Reduced from INFO
    logger.setTagLevel("PIDControl", ESP_LOG_WARN);     // Reduced from INFO
    logger.setTagLevel("SystemInit", ESP_LOG_INFO);     // Keep for startup tracking
    logger.setTagLevel(LOG_TAG_MAIN, ESP_LOG_INFO);     // Keep for main flow
    logger.setTagLevel("HWScheduler", ESP_LOG_WARN);    // Reduced from INFO
    logger.setTagLevel("NTPTask", ESP_LOG_WARN);        // Reduced from INFO
    logger.setTagLevel("NTPClient", ESP_LOG_WARN);      // Reduced from DEBUG
    
    // ========== Hardware Devices ==========
    // Debug level controlled by compile flags
    #ifdef MB8ART_DEBUG
        logger.setTagLevel("MB8ART", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("MB8ART", ESP_LOG_WARN);      // Reduced from INFO
    #endif
    
    #ifdef RYN4_DEBUG
        logger.setTagLevel("RYN4", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("RYN4", ESP_LOG_WARN);         // Reduced from INFO
    #endif
    
    // Modbus components - reduce noise during startup
    #ifdef MODBUSDEVICE_DEBUG
        logger.setTagLevel("ModbusD", ESP_LOG_DEBUG);
        logger.setTagLevel("ModbusDevice", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("ModbusD", ESP_LOG_WARN);      // Reduced from INFO
        logger.setTagLevel("ModbusDevice", ESP_LOG_WARN); // Reduced from INFO
    #endif
    
    #ifdef ESP32MODBUSRTU_DEBUG
        logger.setTagLevel("ModbusRTU", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("ModbusRTU", ESP_LOG_WARN);    // Reduced from INFO
    #endif
    
    // ========== Network Components ==========
    // These can be very verbose, especially during connection
    #ifdef ETH_DEBUG
        logger.setTagLevel("ETH", ESP_LOG_DEBUG);
        logger.setTagLevel("EthernetManager", ESP_LOG_DEBUG);
        logger.setTagLevel("NetworkMonitor", ESP_LOG_DEBUG);
        logger.setTagLevel("sys_evt", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("ETH", ESP_LOG_WARN);
        logger.setTagLevel("EthernetManager", ESP_LOG_WARN);
        logger.setTagLevel("NetworkMonitor", ESP_LOG_WARN);  // Add NetworkMonitor tag
        logger.setTagLevel("sys_evt", ESP_LOG_WARN);         // Add system event tag
    #endif
    
    #ifdef OTA_DEBUG
        logger.setTagLevel("OTAMgr", ESP_LOG_DEBUG);
        logger.setTagLevel("OTAManager", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("OTAMgr", ESP_LOG_WARN);
        logger.setTagLevel("OTAManager", ESP_LOG_WARN);
    #endif
    
