packerlschupfer/esp32-boiler-controller/src/main.cpp
    logger.setTagLevel("MQTTManager", ESP_LOG_WARN);
    logger.setTagLevel("MQTTTask", ESP_LOG_WARN);
    
    // ========== Utility Libraries ==========
    // These are usually very noisy and not needed unless debugging
    #ifdef TASK_MANAGER_DEBUG
        logger.setTagLevel("TaskManager", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("TaskManager", ESP_LOG_ERROR);
    #endif
    
    logger.setTagLevel("SemaphoreGuard", ESP_LOG_ERROR);
    logger.setTagLevel("MutexGuard", ESP_LOG_ERROR);
    logger.setTagLevel("Watchdog", ESP_LOG_ERROR);
    logger.setTagLevel("PStore", ESP_LOG_WARN);  // PersistentStorage
    logger.setTagLevel("PersistentStora", ESP_LOG_WARN);  // Truncated tag
    
    // ========== BLE Components Removed ==========
    // BLE functionality removed - using MB8ART channel 7 for inside temperature
    
    // ========== Monitoring ==========
    #ifdef MONITOR_TASK_DEBUG
        logger.setTagLevel("MonitoringTask", ESP_LOG_DEBUG);
        logger.setTagLevel("MON", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("MonitoringTask", ESP_LOG_WARN);  // Reduced from INFO
        logger.setTagLevel("MON", ESP_LOG_WARN);             // Reduced from INFO
    #endif
    
    LOG_INFO(LOG_TAG_MAIN, "Library logging configured - Critical: INFO, Hardware: %s, Network: WARN, Utility: ERROR",
             #if defined(MB8ART_DEBUG)
             "MB8ART:DEBUG"
             #elif defined(RYN4_DEBUG)
             "RYN4:DEBUG"
             #else
             "WARN"
             #endif
    );
    #endif // LOG_NO_CUSTOM_LOGGER
}

void setQuietMode() {
    #ifndef LOG_NO_CUSTOM_LOGGER
    Logger& logger = Logger::getInstance();
    
    // Set global level to ERROR
    logger.setLogLevel(ESP_LOG_ERROR);
    
    // But keep critical components at WARN level
    logger.setTagLevel("BurnerControl", ESP_LOG_WARN);
    logger.setTagLevel("HeatingControl", ESP_LOG_WARN);
    logger.setTagLevel("WheaterControl", ESP_LOG_WARN);
    logger.setTagLevel("SystemInit", ESP_LOG_WARN);
    logger.setTagLevel(LOG_TAG_MAIN, ESP_LOG_WARN);
    
    // Silence everything else
    logger.setTagLevel("MB8ART", ESP_LOG_ERROR);
    logger.setTagLevel("RYN4", ESP_LOG_ERROR);
    logger.setTagLevel("ModbusD", ESP_LOG_NONE);
    logger.setTagLevel("ModbusDevice", ESP_LOG_NONE);
    logger.setTagLevel("ModbusRTU", ESP_LOG_NONE);
    
    LOG_WARN(LOG_TAG_MAIN, "Quiet mode enabled - minimal logging");
    #endif
}

void setVerboseMode() {
    #ifndef LOG_NO_CUSTOM_LOGGER
    Logger& logger = Logger::getInstance();
    
    // Set global level to VERBOSE
    logger.setLogLevel(ESP_LOG_VERBOSE);
    
    // Enable verbose logging for all major components
    logger.setTagLevel("MB8ART", ESP_LOG_VERBOSE);
    logger.setTagLevel("RYN4", ESP_LOG_VERBOSE);
    logger.setTagLevel("ModbusD", ESP_LOG_DEBUG);
    logger.setTagLevel("ModbusDevice", ESP_LOG_DEBUG);
    logger.setTagLevel("ModbusRTU", ESP_LOG_DEBUG);
    logger.setTagLevel("BurnerControl", ESP_LOG_DEBUG);
    logger.setTagLevel("HeatingControl", ESP_LOG_DEBUG);
    logger.setTagLevel("WheaterControl", ESP_LOG_DEBUG);
    
    // But keep utility libraries reasonable
    logger.setTagLevel("TaskManager", ESP_LOG_INFO);
    logger.setTagLevel("SemaphoreGuard", ESP_LOG_WARN);
    logger.setTagLevel("MutexGuard", ESP_LOG_WARN);
    
    LOG_INFO(LOG_TAG_MAIN, "Verbose mode enabled - detailed logging");
    #endif
}

void enableLibraryDebug(const char* libName) {
    #ifndef LOG_NO_CUSTOM_LOGGER
    if (!libName) return;
    
    Logger& logger = Logger::getInstance();
    logger.setTagLevel(libName, ESP_LOG_DEBUG);
    
    LOG_INFO(LOG_TAG_MAIN, "Debug logging enabled for library: %s", libName);
    
    // Also enable related tags for common libraries
    if (strcmp(libName, "MB8ART") == 0) {
        logger.setTagLevel("ModbusDevice", ESP_LOG_DEBUG);
    } else if (strcmp(libName, "RYN4") == 0) {
        logger.setTagLevel("ModbusDevice", ESP_LOG_DEBUG);
    } else if (strcmp(libName, "ETH") == 0) {
        logger.setTagLevel("EthernetManager", ESP_LOG_DEBUG);
    } else if (strcmp(libName, "OTAMgr") == 0) {
        logger.setTagLevel("OTAManager", ESP_LOG_DEBUG);
    }
    #endif
}

// Example: MQTT command handler for runtime log control
// Add this to your MQTT command processing:
/*
void handleMQTTLogCommand(const char* command, const char* payload) {
    if (strcmp(command, "log/mode/quiet") == 0) {
        setQuietMode();
    } else if (strcmp(command, "log/mode/verbose") == 0) {
        setVerboseMode();
    } else if (strcmp(command, "log/mode/normal") == 0) {
        configureLibraryLogging();
    } else if (strcmp(command, "log/debug/enable") == 0) {
        enableLibraryDebug(payload);  // payload = library name
    } else if (strcmp(command, "log/level/set") == 0) {
        // Format: "library:level" e.g., "MB8ART:DEBUG" or "global:WARN"
        char lib[32] = {0};    // Zero-initialize for safety
        char level[16] = {0};  // Zero-initialize for safety
        if (sscanf(payload, "%31[^:]:%15s", lib, level) == 2) {
            esp_log_level_t logLevel = ESP_LOG_INFO;
            if (strcmp(level, "ERROR") == 0) logLevel = ESP_LOG_ERROR;
            else if (strcmp(level, "WARN") == 0) logLevel = ESP_LOG_WARN;
            else if (strcmp(level, "INFO") == 0) logLevel = ESP_LOG_INFO;
            else if (strcmp(level, "DEBUG") == 0) logLevel = ESP_LOG_DEBUG;
            else if (strcmp(level, "VERBOSE") == 0) logLevel = ESP_LOG_VERBOSE;
            else if (strcmp(level, "NONE") == 0) logLevel = ESP_LOG_NONE;
            
            if (strcmp(lib, "global") == 0) {
                Logger::getInstance().setLogLevel(logLevel);
                LOG_INFO(LOG_TAG_MAIN, "Global log level set to %s", level);
            } else {
                Logger::getInstance().setTagLevel(lib, logLevel);
                LOG_INFO(LOG_TAG_MAIN, "Log level for %s set to %s", lib, level);
            }
        }
    }
}
*/

void restoreNormalLogging() {
    #ifndef LOG_NO_CUSTOM_LOGGER
    Logger& logger = Logger::getInstance();
    
    LOG_INFO(LOG_TAG_MAIN, "Restoring normal logging levels after startup...");
    
