packerlschupfer/esp32-boiler-controller/src/main.cpp
    // Restore system components based on debug flags
    #ifdef CONTROL_MODULE_DEBUG
        logger.setTagLevel("BurnerControl", ESP_LOG_DEBUG);
        logger.setTagLevel("HeatingControl", ESP_LOG_DEBUG);
        logger.setTagLevel("WheaterControl", ESP_LOG_DEBUG);
        logger.setTagLevel("PIDControl", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("BurnerControl", ESP_LOG_INFO);
        logger.setTagLevel("HeatingControl", ESP_LOG_INFO);
        logger.setTagLevel("WheaterControl", ESP_LOG_INFO);
        logger.setTagLevel("PIDControl", ESP_LOG_INFO);
    #endif
    
    logger.setTagLevel("HWScheduler", ESP_LOG_INFO);
    logger.setTagLevel("NTPTask", ESP_LOG_INFO);
    
    // Hardware devices back to INFO
    #ifndef MB8ART_DEBUG
        logger.setTagLevel("MB8ART", ESP_LOG_INFO);
    #endif
    
    #ifndef RYN4_DEBUG
        logger.setTagLevel("RYN4", ESP_LOG_INFO);
    #endif
    
    // Modbus components back to INFO
    #ifndef MODBUSDEVICE_DEBUG
        logger.setTagLevel("ModbusD", ESP_LOG_INFO);
        logger.setTagLevel("ModbusDevice", ESP_LOG_INFO);
    #endif
    
    #ifndef ESP32MODBUSRTU_DEBUG
        logger.setTagLevel("ModbusRTU", ESP_LOG_INFO);
    #endif
    
    // Network components
    #ifdef ETH_DEBUG
        logger.setTagLevel("ETH", ESP_LOG_DEBUG);
        logger.setTagLevel("EthernetManager", ESP_LOG_DEBUG);
        logger.setTagLevel("NetworkMonitor", ESP_LOG_DEBUG);
        logger.setTagLevel("sys_evt", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("ETH", ESP_LOG_INFO);
        logger.setTagLevel("EthernetManager", ESP_LOG_INFO);
        logger.setTagLevel("NetworkMonitor", ESP_LOG_INFO);
        logger.setTagLevel("sys_evt", ESP_LOG_INFO);
    #endif
    
    // OTA components
    #ifdef OTA_DEBUG
        logger.setTagLevel("OTAMgr", ESP_LOG_DEBUG);
        logger.setTagLevel("OTAManager", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("OTAMgr", ESP_LOG_INFO);
        logger.setTagLevel("OTAManager", ESP_LOG_INFO);
    #endif
    
    // Task Manager
    #ifdef TASK_MANAGER_DEBUG
        logger.setTagLevel("TaskManager", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("TaskManager", ESP_LOG_INFO);
    #endif
    
    // Temperature sensor
    #ifdef ANDRTF3_DEBUG
        logger.setTagLevel("ANDRTF3", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("ANDRTF3", ESP_LOG_INFO);
    #endif
    
    // Monitoring - adjust based on debug flag
    #ifdef MONITOR_TASK_DEBUG
        logger.setTagLevel("MonitoringTask", ESP_LOG_DEBUG);
        logger.setTagLevel("MON", ESP_LOG_DEBUG);
    #else
        logger.setTagLevel("MonitoringTask", ESP_LOG_INFO);
        logger.setTagLevel("MON", ESP_LOG_INFO);
    #endif
    
    LOG_INFO(LOG_TAG_MAIN, "Normal logging levels restored");
    #endif
}